/**
 * 更新日志（静态数据）
 * 发版时在数组头部追加新条目，新在前、旧在后。
 * 字段：version, date (YYYY-MM-DD), items[], 可选 title
 */
module.exports = [
  {
    version: '1.8.0',
    date: '2026-04-28',
    // title: '新功能',
    items: ['新增游戏大厅和 2048 小游戏，晚上煮一袋辛拉面加亿点娃娃菜再加个蛋再配根玉米肠！'],
  },
  {
    version: '1.7.2',
    date: '2026-04-27',
    // title: '新功能',
    items: ['「每日签到可获得 50 积分！」别骂了别骂了，🌝在改的路上了，然后炫了一碗凉皮先生'],
  },
  {
    version: '1.7.1',
    date: '2026-04-20',
    // title: '新功能',
    items: ['新增「关于」入口，便于监视小程序。好像属于榴莲大王的季节要来了（上火.zip'],
  },
  {
    version: '1.7.0',
    date: '2026-04-14',
    items: [
      '新增待办清单微信通知功能，终于实现提醒了！然后买了QQ软糖、脆脆鲨、拖肥、小米锅巴、大刀肉、霸王丝～',
    ],
  },
  {
    version: '1.6.4',
    date: '2026-03-27',
    items: ['新增纪念日排序功能，然后亲了一口阿豹豹～'],
  },
  {
    version: '1.6.3',
    date: '2026-02-13',
    items: ['修改了一些文案，然后发了会呆...'],
  },
  {
    version: '1.6.3',
    date: '2025-12-31',
    items: ['纠正了节假日，然后发了会呆...'],
  },
  {
    version: '1.6.2',
    date: '2025-09-09',
    items: ['新增纪念日天数换算为年'],
  },
  {
    version: '1.6.1',
    date: '2025-08-25',
    items: ['修复首页公告中倒计时逻辑错误问题'],
  },
  {
    version: '1.6.0',
    date: '2025-06-06',
    items: ['优化了一些文案'],
  },
  {
    version: '1.6.0',
    date: '2025-05-26',
    items: ['优化待办清单逻辑'],
  },
  {
    version: '1.5.9',
    date: '2025-05-23',
    items: ['个人中心新增随机祝福语'],
  },
  {
    version: '1.5.8',
    date: '2025-05-19',
    items: ['进一步完善公告逻辑'],
  },
  {
    version: '1.5.7',
    date: '2025-05-16',
    items: ['尝试实现订阅提醒机制，失败了...'],
  },
  {
    version: '1.5.7',
    date: '2025-05-06',
    items: ['新增公告功能'],
  },
  {
    version: '1.5.7',
    date: '2025-05-16',
    items: ['尝试实现订阅提醒机制，失败了...'],
  },

  {
    version: 'x.x.x',
    date: 'xxxx-xx-xx',
    // title: '太遥远了，慢慢更新吧',
    items: ['有点多，慢慢更新吧～'],
  },

  {
    version: '1.1.1',
    date: '2022-09-28',
    items: ['完善纪念日功能逻辑，并优化了样式～'],
  },
  {
    version: '1.1.0',
    date: '2022-09-19',
    items: ['重新实现首页的布局', '新增纪念日功能～'],
  },
  {
    version: '1.0.3',
    date: '2022-03-24',
    items: ['尝试使用云开发，将资源和数据整合到云环境中', '修复了一些 bug'],
  },
  {
    version: '1.0.2',
    date: '2022-03-15',
    items: ['新增个人中心，获取微信头像和昵称并显示'],
  },
  {
    version: '1.0.1',
    date: '2022-01-17',
    items: ['新增节假日显示功能'],
  },
  {
    version: '1.0.0',
    date: '2021-11-25',
    items: ['虽然只有位置天气显示功能，但小程序诞生啦！🎉🎉🎉'],
  },
];
