/**
 * 更新日志（静态数据）
 * 发版时在数组头部追加新条目，新在前、旧在后。
 * 字段：version, date (YYYY-MM-DD), items[], 可选 title
 */
module.exports = [
  {
    version: '1.7.1',
    date: '2026-04-20',
    // title: '新功能',
    items: ['新增「关于」入口，便于监视小程序。好像属于榴莲大王的季节要来了（上火.zip'],
  },
  {
    version: '1.7.0',
    date: '2026-04-14',
    items: ['新增待办清单微信通知功能，然后买了QQ软糖、脆脆鲨、拖肥、小米锅巴、大刀肉、霸王丝～'],
  },
  {
    version: '1.6.4',
    date: '2026-03-27',
    items: ['新增纪念日排序功能，然后亲了一口阿豹豹～'],
  },
  {
    version: '1.6.3',
    date: '2026-02-13',
    items: ['修改了一些文案，然后发了会呆...'],
  },
  {
    version: '1.6.3',
    date: '2025-12-31',
    items: ['纠正了节假日，然后发了会呆...'],
  },
  {
    version: '1.6.2',
    date: '2025-09-09',
    items: ['新增纪念日天数换算为年'],
  },
  {
    version: '1.6.1',
    date: '2025-08-25',
    items: ['修复首页公告中倒计时逻辑错误问题'],
  },
  {
    version: 'x.x.x',
    date: 'xxxx-xx-xx',
    // title: '太遥远了，慢慢更新吧',
    items: ['有点多，慢慢更新吧～'],
  },
];
